In [2]:
#Membentuk kolom bertipe datetime dari beberapa kolom lain pada Pandas Data Frame

In [3]:
import pandas as pd, numpy as np

In [4]:
data = {'day':[1, 2, 10, 25, 12],
       'month':[1, 2, 4, 5, 6],
       'year':[2000, 2001, 2010, 2015, 2020]}

df = pd.DataFrame(data)

df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

In [5]:
df['penanggalan'] = pd.to_datetime(df[['day', 'month', 'year']])
#nama kolom harus bhs inggris
df

   day  month  year penanggalan
0    1      1  2000  2000-01-01
1    2      2  2001  2001-02-02
2   10      4  2010  2010-04-10
3   25      5  2015  2015-05-25
4   12      6  2020  2020-06-12

In [ ]:
df.dtypes